<?php
$site['social'] = true; // กำหนดให้เว็บไซต์ใช้งาน Open Graph ได้
$site['cdn'] = array('tawk'); // กำหนดให้เว็บไซต์ใช้งาน CDN ที่กำหนดได้
$site['name'] = 'เงื่อนไขการให้บริการ - ' . config('site.name');
$site['desc'] = config('site.description');
$site['bot'] = '';
?>

<?= views('template/front/header') ?>

<body>
    <?= visitor_views('layouts/navbar') ?>
    <div class="body container">
        <h1>เงื่อนไขการให้บริการ</h1>
        <p>ตลอดเว็บไซต์นี้ คำว่า "ผู้ใช้บริการ" หมายถึงบุคคลใดๆที่เข้าถึงเว็บไซต์นี้</p>
        <p>การใช้เว็บไซต์นี้ต้องเป็นไปตามข้อตกลงและเงื่อนไขการใช้บริการต่อไปนี้ ซึ่งผู้ใช้บริการควรอ่านอย่างละเอียด การใช้เว็บไซต์หรือเข้าไปดูข้อมูลในหน้าใดๆ ถือว่าท่านยอมรับข้อกำหนดและเงื่อนไขการใช้งานที่ระบุไว้ในข้อกำหนดและเงื่อนไขการใช้งานนี้</p>
        <p>ข้อมูลทั้งหมดในเว็บไซต์ https://lastboss.itsvc.dev นี้ ("เนื้อหา") ย่อมได้รับความคุ้มครองตามสิทธิในลิขสิทธิ์ เครื่องหมายการค้า และสิทธิในความเป็นเจ้าของไม่ว่าในรูปแบบใดๆ สิทธิทั้งหลายในเนื้อหาเหล่านี้เป็นสิทธิของผู้ให้บริการ</p>
        <p>เว้นแต่จะกำหนดไว้เพื่อการอื่นโดยเฉพาะ ข้อมูลทั้งหมดที่ปรากฏในเว็บไซต์นี้ ผู้ใช้บริการมีเพียงสิทธิชม ดาวน์โหลด อัพโหลดเนื้อหา และพิมพ์เนื้อหาดังกล่าวเพียงสำเนาหนึ่งชุดเพื่อการใช้งานส่วนตัว และมิใช่ทางการค้า ผู้ใช้บริการตกลงจะรักษาข้อความที่แสดงถึงลิขสิทธิ์และสิทธิในความเป็นเจ้าของอื่นใดที่ปรากฏในเว็บไซต์นี้ โดยผู้ใช้บริการไม่อาจทำสำเนา หรือจัดเก็บ หรือดาวน์โหลดข้อมูล ไม่ว่าจะในรูปของเอกสาร หรือในระบบของสื่ออิเล็กทรอนิกส์ ส่ง โอน จัดทำ เผยแพร่ พิมพ์ ทำซ้ำ สร้างงานที่พัฒนา แสดง แพร่กระจาย จำหน่าย ให้สิทธิเช่า ให้เช่า หรือโอนเนื้อหาใดๆให้แก่บุคคลภายนอก ไม่ว่าจะในทางการค้าหรือได้รับประโยชน์ในทางอื่นใดปราศจากการได้รับอนุญาตล่วงหน้าเป็นลายลักษณ์อักษรจากผู้ให้บริการ</p>

        <h2>ผู้ใช้บริการ (User)</h2>
        <p>ผู้ใช้บริการจะต้องกรอกข้อมูลส่วนตัวตามความเป็นจริงเท่านั้น หากผู้ให้บริการตรวจสอบว่า ผู้ใช้บริการให้ข้อมูลอันเป็นเท็จ ผู้ให้บริการสามารถระงับการให้บริการได้ทันทีโดยไม่ต้อง แจ้งล่วงหน้า</p>
        <p>ผู้ใช้บริการจะต้องรายงานข้อมูลที่เป็นความจริง พร้อมทั้งมีข้อมูลประกอบที่เพียงพอ โดยข้อมูลที่ถูกนำเข้า จะต้องเป็นของผู้ใช้บริการ หรือ ได้รับความยินยอมจากบุคคลที่เกี่ยวข้องแล้วเท่านั้น ทาง lastboss.itsvc.dev จะไม่รับผิดชอบต่อสิ่งที่ผู้ใช้บริการละเมิดและสร้างความเสียหายใดๆ กับผู้อื่นในทุกกรณี โดยจะถือว่าข้อมูลที่ผู้ใช้บริการนำเข้ามาใน lastboss.itsvc.dev เป็นความรับผิดชอบของผู้ใช้บริการนั้นๆแต่เพียงผู้เดียว</p>
        <p>ห้ามผู้ใช้บริการนำเข้าข้อมูลในเชิงข่มขู่ ใช้ภาษารุนแรง หยาบคาย ไม่สุภาพ หรือนำเข้าเรื่องส่วนตัวของบุคคลที่สาม โดยไม่มีข้อยกเว้นทั้งสิ้น</p>
        <p>ห้ามใช้ lastboss.itsvc.dev เพื่อผลประโยชน์ทางธุรกิจในทุกรูปแบบ ทั้งการแอบอ้าง หรือขายบริการต่อ หากท่านทำความเสียหาย ให้กับผู้อื่น ทาง lastboss.itsvc.dev จะไม่รับผิดชอบต่อข้อเสียหายในทุกกรณี ทั้งนี้ผู้ให้บริการเปิดให้บริการสำหรับการใช้เพื่อส่วนตัวเท่านั้น</p>

        <h2>ผู้ให้บริการ (Service Provider)</h2>
        <p>ผู้ให้บริการขอสงวนสิทธิ์อย่างเด็ดขาดในการเปลี่ยนแปลงหรือแก้ไขข้อตกลงและเงื่อนไขใดๆ ในการใช้บริการเว็บไซต์นี้ ไม่ว่าทั้งหมดหรือบางส่วน โดยไม่จำเป็นต้องแจ้งให้ผู้ใช้บริการทราบล่วงหน้า และการที่ผู้ใช้บริการยังคงใช้บริการเว็บไซต์นี้ย่อมถือว่าท่านยอมผูกพันตามข้อตกลงและเงื่อนไขที่มีการเปลี่ยนแปลงหรือบังคับใช้แล้วทุกประการ หากพบว่าผู้ใช้บริการ ละเมิดข้อตกลงที่ได้กำหนดไว้ lastboss.itsvc.dev ขอสงวนสิทธิ์ในการระงับการให้บริการ โดยมิต้องแจ้งให้ทราบล่วงหน้า</p>
        <p>หากพบว่าผู้ใช้บริการ ละเมิดข้อห้ามตามข้อตกลง หรือผิดต่อ พ.ร.บ.ว่าด้วยการกระทำผิด เกี่ยวกับระบบคอมพิวเตอร์ หรือ นำไปใช้ในทางที่ผิดต่อกฎหมายในราชอาณาจักรไทย ผู้ให้บริการที่ขอสงวนสิทธิงดให้บริการแก่ผู้ใช้บริการผู้นั้นต่อไป รวมทั้งลบรายงานของผู้ใช้บริการท่านนั้น ทันที</p>
        <p>ระบบจะมีการตรวจจับการสะกดชื่อ การกรอกอักขระผิดต่างๆ รวมถึงการตรวจสอบชื่อโดยเปรียบเทียบกับใบเสร็จที่แนบเข้ามาในรายงาน หากพบว่ามีการสะกดชื่อแตกต่างจากใบเสร็จที่ได้ลงไว้ ระบบจะทำการแก้ไขข้อมูลอัตโนมัติ (เท่าที่ระบบจะสามารถทำได้) รวมทั้งแก้ไขข้อมูลที่เกิดจากการลงผิดพลาด เช่นการลงข้อมูลชื่อผู้บริสุทธิ์จากรูปบัตรประชาชนที่คนขายส่งมาเพื่อตั้งใจแอบอ้าง ทั้งนี้คำนึงถึงความถูกต้องของข้อมูลเป็นสำคัญ และเป็นการแก้ปัญหาการกรอกข้อมูลที่ไม่ถูกต้อง เพื่อป้องกันปัญหาที่จะเกิดกับผู้บริสุทธิ์</p>

        <h2>การปฏิเสธความรับผิดและข้อจำกัดความรับผิด (Disclaimer Policy)</h2>
        <p>ผู้ให้บริการไม่รับรองหรือรับประกัน และขอปฏิเสธความรับผิดชอบต่อข้อมูลใดๆที่ผู้ใช้บริการนำเข้ามา ไม่ว่าโดยชัดแจ้งหรือโดยปริยาย ทั้งความถูกต้อง ความเหมาะสม ความน่าเชื่อถือ การมีอยู่และใช้งานได้ ของข้อมูลและ/หรือเนื้อหาตลอดจนส่วนประกอบต่างๆ ที่มีอยู่ในเว็บไซต์นี้ โดยข้อมูลที่ปรากฏในเว็บไซต์แห่งนี้ จะตกความรับผิดชอบของผู้ใช้บริการผู้นำเสนอข้อมูลนั้นๆ แต่เพียงผู้เดียว โดยข้อมูลในเว็บไซต์นี้เป็นข้อมูลที่มีให้ "ตามสภาพเท่าที่เป็น" และ "เท่าที่อยู่" ซึ่งกระทำผ่านเครื่องคอมพิวเตอร์อัตโนมัติทั้งหมดเท่านั้น ทางเว็บไซต์ไม่รับประกัน หรือรับรองว่าข้อมูลที่ถูกนำเข้ามาจะสมบูรณ์และถูกต้อง และเชื่อถือได้เป็นปัจจุบัน อย่างไรก็ตาม หากผู้ใช้บริการพบข้อมูลที่ไม่เหมาะสม หรือไม่เป็นความจริง ผู้ใช้บริการสามารถร้องเรียนรายงานที่ไม่เหมาะสมได้</p>
        <p>ผู้ให้บริการจะไม่รับผิดชอบต่อความสูญเสียหรือความเสียหายใดๆ ที่เกิดขึ้น ไม่ว่าโดยตรงหรือโดยอ้อม (รวมถึงความเสียหายอันเป็นผลสืบเนื่อง ความเสียหายเกี่ยวเนื่อง และความเสียหายซึ่งไม่ใช่ผลอันอาจคาดหมายได้โดยตรง) จากข้อมูลและการใช้บริการเว็บไซต์นี้</p>
        <p>ทาง lastboss.itsvc.dev ขอสงวนสิทธิ์ในการลบรายงานที่ไม่เหมาะสม หรือ ไม่มีมูลความจริงเท่าที่ควร หรือเป็นข้อมูลทุจริต โดยมิต้องแจ้งให้ทราบล่วงหน้า</p>

        <h2>การละเมิดข้อตกลงในการใช้เว็บไซต์</h2>
        <p>ผู้ให้บริการสงวนสิทธิที่จะได้รับการเยียวยาที่มีขึ้นโดยกฎหมายและในกรณีที่มีการละเมิดข้อตกลงนี้ รวมถึงสิทธิที่จะระงับการเข้าถึงเว็บไซต์ lastboss.itsvc.dev ทางอินเทอร์เน็ต</p>

        <h2>กฎหมายที่บังคับใช้</h2>
        <p>กฎหมายว่าด้วยการคุ้มครองผู้บริโภค พระราชบัญญัตินี้มีบทบัญญัติบางประการเกี่ยวกับการจำกัดสิทธิและเสรีภาพของบุคคล ซึ่งมาตรา ๒๖ ประกอบกับมาตรา ๓๔ มาตรา ๓๗ และมาตรา ๔๐ ของรัฐธรรมนูญแห่งราชอาณาจักรไทย บัญญัติให้กระทำได้โดยอาศัยอำนาจตามบทบัญญัติแห่งกฎหมาย เหตุผลและความจำเป็นในการจำกัดสิทธิและเสรีภาพของบุคคลตามพระราชบัญญัตินี้ เพื่อให้ การคุ้มครองผู้บริโภคด้านความปลอดภัยของสินค้าและบริการมีความเหมาะสมและเป็นไปอย่างมีประสิทธิภาพ อันจะเป็นประโยชน์ต่อการคุ้มครองผู้บริโภค ซึ่งการตราพระราชบัญญัตินี้สอดคล้องกับเงื่อนไขที่บัญญัติไว้ ในมาตรา ๒๖ ของรัฐธรรมนูญแห่งราชอาณาจักรไทยแล้ว จึงทรงพระกรุณาโปรดเกล้าฯ ให้ตราพระราชบัญญัติขึ้นไว้โดยคำแนะนำและยินยอมของ สภานิติบัญญัติแห่งชาติทำหน้าที่รัฐสภา ดังต่อไปนี้</p>
        <p>มาตรา ๓ ในพระราชบัญญัตินี้</p>
        <p>“ซื้อ” หมายความรวมถึง เช่า เช่าซื้อ หรือได้มาไม่ว่าด้วยประการใด ๆ โดยให้ค่าตอบแทนเป็นเงินหรือผลประโยชน์อย่างอื่น</p>
        <p>“ขาย” หมายความรวมถึง ให้เช่า ให้เช่าซื้อ หรือจัดหาให้ไม่ว่าด้วยประการใด ๆ โดยเรียกค่าตอบแทนเป็นเงินหรือผลประโยชน์อย่างอื่น ตลอดจนการเสนอหรือการชักชวนเพื่อการดังกล่าวด้วย</p>
        <p>“สินค้า” หมายความว่า สิ่งของที่ผลิตหรือมีไว้เพื่อขาย</p>
        <p>“บริการ” หมายความว่า การรับจัดทำการงาน การให้สิทธิใด ๆ หรือการให้ใช้หรือให้ประโยชน์ในทรัพย์สินหรือกิจการใด ๆ โดยเรียกค่าตอบแทนเป็นเงินหรือผลประโยชน์อื่นแต่ไม่รวมถึงการจ้างแรงงานตามกฎหมายแรงงาน</p>
        <p>“ผลิต” หมายความว่า ทำ ผสม ปรุง ประกอบ ประดิษฐ์ หรือแปรสภาพและหมายความรวมถึงการเปลี่ยนรูป การดัดแปลง การคัดเลือก หรือการแบ่งบรรจุ</p>
        <p> “ผู้บริโภค” หมายความว่า ผู้ซื้อหรือผู้ได้รับบริการจากผู้ประกอบธุรกิจหรือผู้ซึ่งได้รับการเสนอหรือการชักชวนจากผู้ประกอบธุรกิจเพื่อให้ซื้อสินค้าหรือรับบริการและหมายความรวมถึงผู้ใช้สินค้าหรือผู้ได้รับบริการจากผู้ประกอบธุรกิจโดยชอบ แม้มิได้เป็นผู้เสียค่าตอบแทนก็ตาม</p>
        <p>“ผู้ประกอบธุรกิจ” หมายความว่า ผู้ขาย ผู้ผลิตเพื่อขาย ผู้สั่งหรือนำเข้ามาในราชอาณาจักรเพื่อขายหรือผู้ซื้อเพื่อขายต่อซึ่งสินค้า หรือผู้ให้บริการ และหมายความรวมถึงผู้ประกอบกิจการโฆษณาด้วย</p>
        <p>“ข้อความ” หมายความรวมถึงการกระทำให้ปรากฏด้วยตัวอักษร ภาพ ภาพยนตร์ แสง เสียง เครื่องหมายหรือการกระทำอย่างใด ๆ ที่ทำให้บุคคลทั่วไปสามารถเข้าใจความหมายได้</p>
        <p>“โฆษณา” หมายความถึงกระทำการไม่ว่าโดยวิธีใด ๆ ให้ประชาชนเห็นหรือทราบข้อความ เพื่อประโยชน์ในทางการค้า</p>
        <p>“สื่อโฆษณา” หมายความว่า สิ่งที่ใช้เป็นสื่อในการโฆษณา เช่น หนังสือพิมพ์ สิ่งพิมพ์ วิทยุกระจายเสียง วิทยุโทรทัศน์ ไปรษณีย์โทรเลข โทรศัพท์ หรือป้าย</p>
        <p>“ฉลาก” หมายความว่า รูป รอยประดิษฐ์ กระดาษหรือสิ่งอื่นใดที่ทำให้ปรากฏข้อความเกี่ยวกับสินค้าซึ่งแสดงไว้ที่สินค้าหรือภาชนะบรรจุหรือหีบห่อบรรจุสินค้า หรือสอดแทรกหรือรวมไว้กับสินค้าหรือภาชนะบรรจุหรือหีบห่อบรรจุสินค้า และหมายความรวมถึงเอกสารหรือคู่มือสำหรับใช้ประกอบกับสินค้า ป้ายที่ติดตั้งหรือแสดงไว้ที่สินค้าหรือภาชนะบรรจุหรือหีบห่อบรรจุสินค้านั้น</p>
        <p>“สัญญา” หมายความว่า ความตกลงกันระหว่างผู้บริโภคและผู้ประกอบธุรกิจเพื่อซื้อและขายสินค้าหรือให้และรับบริการ</p>
        <p>“คณะกรรมการ” หมายความว่า คณะกรรมการคุ้มครองผู้บริโภค</p>
        <p>“กรรมการ” หมายความว่า กรรมการคุ้มครองผู้บริโภค</p>
        <p>“พนักงานเจ้าหน้าที่” หมายความว่า ผู้ซึ่งรัฐมนตรีแต่งตั้งให้ปฏิบัติการตามพระราชบัญญัตินี้</p>
        <p>“รัฐมนตรี” หมายความว่า รัฐมนตรีผู้รักษาการตามพระราชบัญญัตินี้</p>
        <p>มาตรา ๙ ให้มีคณะกรรมการคณะหนึ่งเรียกว่า “คณะกรรมการคุ้มครองผู้บริโภค” ประกอบด้วยนายกรัฐมนตรีเป็นประธานกรรมการ ปลัดสำนักนายกรัฐมนตรี ปลัดกระทรวงเกษตรและสหกรณ์ ปลัดกระทรวงคมนาคม ปลัดกระทรวงดิจิทัลเพื่อเศรษฐกิจและสังคม ปลัดกระทรวงพาณิชย์ ปลัดกระทรวงมหาดไทย ปลัดกระทรวงสาธารณสุข ปลัดกระทรวงอุตสาหกรรม และผู้ทรงคุณวุฒิอีกไม่เกินแปดคนซึ่งคณะรัฐมนตรีแต่งตั้งตามหลักเกณฑ์ที่รัฐมนตรีกำหนด โดยต้องมีผู้แทนที่มีความรู้ความเชี่ยวชาญด้านการคุ้มครองผู้บริโภคจากภาควิชาการ ภาคประชาชน และภาคผู้ประกอบธุรกิจ อย่างน้อยภาคละสองคน เป็นกรรมการ ให้เลขาธิการคณะกรรมการคุ้มครองผู้บริโภคเป็นกรรมการและเลขานุการ และให้เลขาธิการคณะกรรมการคุ้มครองผู้บริโภคแต่งตั้งข้าราชการในสำนักงานคณะกรรมการคุ้มครองผู้บริโภคจำนวนไม่เกินสองคนเป็นผู้ช่วยเลขานุการ</p>
        <p> มาตรา ๓๕ อัฏฐ ผู้ประกอบธุรกิจมีหน้าที่ส่งมอบสัญญาที่มีข้อสัญญาหรือมีข้อสัญญาและแบบถูกต้องตามมาตรา ๓๕ ทวิ หรือส่งมอบหลักฐานการรับเงินที่มีรายการและข้อความถูกต้องตามมาตรา ๓๕ เบญจ ให้แก่ผู้บริโภคภายในระยะเวลาที่เป็นทางปฏิบัติตามปกติสำหรับการประกอบธุรกิจประเภทนั้น ๆ หรือภายในระยะเวลาที่คณะกรรมการว่าด้วยสัญญากำหนด โดยประกาศในราชกิจจานุเบกษาสุดแต่ระยะเวลาใดจะถึงก่อน</p>
        <p>มาตรา ๑๔ ผู้ใดกระทําความผิดที่ระบุไว้ดังต่อไปนี้ ต้องระวางโทษจําคุกไม่เกินห้าปี หรือปรับไม่เกินหนึ่งแสนบาท หรือทั้งจําทั้งปรับ</p>
        <p>(๑) โดยทุจริต หรือโดยหลอกลวง นําเข้าสู่ระบบคอมพิวเตอร์ซึ่งข้อมูลคอมพิวเตอร์ที่บิดเบือน หรือปลอมไม่ว่าทั้งหมดหรือบางส่วน หรือข้อมูลคอมพิวเตอร์อันเป็นเท็จ โดยประการที่น่าจะเกิดความเสียหาย แก่ประชาชน อันมิใช่การกระทําความผิดฐานหมิ่นประมาทตามประมวลกฎหมายอาญา</p>
        <p>(๒) นําเข้าสู่ระบบคอมพิวเตอร์ซึ่งข้อมูลคอมพิวเตอร์อันเป็นเท็จ โดยประการที่น่าจะเกิด ความเสียหายต่อการรักษาความมั่นคงปลอดภัยของประเทศ ความปลอดภัยสาธารณะ ความมั่นคง ในทางเศรษฐกิจของประเทศ หรือโครงสร้างพื้นฐานอันเป็นประโยชน์สาธารณะของประเทศ หรือก่อให้เกิด ความตื่นตระหนกแก่ประชาชน</p>
        <p>(๓) นําเข้าสู่ระบบคอมพิวเตอร์ซึ่งข้อมูลคอมพิวเตอร์ใดๆ อันเป็นความผิดเกี่ยวกับความมั่นคง แห่งราชอาณาจักรหรือความผิดเกี่ยวกับการก่อการร้ายตามประมวลกฎหมายอาญา</p>
        <p>(๔) นําเข้าสู่ระบบคอมพิวเตอร์ซึ่งข้อมูลคอมพิวเตอร์ใดๆ ที่มีลักษณะอันลามกและข้อมูล คอมพิวเตอร์นั้นประชาชนทั่วไปอาจเข้าถึงได้</p>
        <p>(๕) เผยแพร่หรือส่งต่อซึ่งข้อมูลคอมพิวเตอร์โดยรู้อยู่แล้วว่าเป็นข้อมูลคอมพิวเตอร์ตาม (๑) (๒) (๓) หรือ (๔)</p>
        <p>ถ้าการกระทําความผิดตามวรรคหนึ่ง (๑) มิได้กระทําต่อประชาชน แต่เป็นการกระทําต่อบุคคลใด บุคคลหนึ่ง ผู้กระทํา ผู้เผยแพร่หรือส่งต่อซึ่งข้อมูลคอมพิวเตอร์ดังกล่าวต้องระวางโทษจําคุกไม่เกินสามปี หรือปรับไม่เกินหกหมื่นบาท หรือทั้งจําทั้งปรับ และให้เป็นความผิดอันยอมความได้”</p>
        <p>มาตรา ๑๖/๒ ผู้ใดรู้ว่าข้อมูลคอมพิวเตอร์ในความครอบครองของตนเป็นข้อมูลที่ศาลสั่งให้ทําลาย ตามมาตรา ๑๖/๑ ผู้นั้นต้องทําลายข้อมูลดังกล่าว หากฝ่าฝืนต้องระวางโทษกึ่งหนึ่งของโทษที่บัญญัติไว้ ในมาตรา ๑๔ หรือมาตรา ๑๖ แล้วแต่กรณี</p>
        <p>มาตรา ๑๘ ภายใต้บังคับมาตรา ๑๙ เพื่อประโยชน์ในการสืบสวนและสอบสวนในกรณีที่มี เหตุอันควรเชื่อได้ว่ามีการกระทําความผิดตามพระราชบัญญัตินี้ หรือในกรณีที่มีการร้องขอตามวรรคสอง ให้พนักงานเจ้าหน้าที่มีอํานาจอย่างหนึ่งอย่างใด ดังต่อไปนี้</p>
        เฉพาะที่จําเป็นเพื่อประโยชน์ในการใช้เป็น หลักฐานเกี่ยวกับการกระทําความผิดและหาตัวผู้กระทําความผิด</p>
        <p>(๑) มีหนังสือสอบถามหรือเรียกบุคคลที่เกี่ยวข้องกับการกระทําความผิดมาเพื่อให้ถ้อยคํา ส่งคําชี้แจงเป็นหนังสือ หรือส่งเอกสาร ข้อมูล หรือหลักฐานอื่นใดที่อยู่ในรูปแบบที่สามารถเข้าใจได้</p>
        <p>(๒) เรียกข้อมูลจราจรทางคอมพิวเตอร์จากผู้ให้บริการเกี่ยวกับการติดต่อสื่อสารผ่านระบบคอมพิวเตอร์ หรือจากบุคคลอื่นที่เกี่ยวข้อง</p>
        <p>(๓) สั่งให้ผู้ให้บริการส่งมอบข้อมูลเกี่ยวกับผู้ใช้บริการที่ต้องเก็บตามมาตรา ๒๖ หรือที่อยู่ ในความครอบครองหรือควบคุมของผู้ให้บริการให้แก่พนักงานเจ้าหน้าที่หรือให้เก็บข้อมูลดังกล่าวไว้ก่อน</p>
        <p>(๔) ทําสําเนาข้อมูลคอมพิวเตอร์ ข้อมูลจราจรทางคอมพิวเตอร์จากระบบคอมพิวเตอร์ที่มี เหตุอันควรเชื่อได้ว่ามีการกระทําความผิด ในกรณีที่ระบบคอมพิวเตอร์นั้นยังมิได้อยู่ในความครอบครอง ของพนักงานเจ้าหน้าที่</p>
        <p>(๕) สั่งให้บุคคลซึ่งครอบครองหรือควบคุมข้อมูลคอมพิวเตอร์ หรืออุปกรณ์ที่ใช้เก็บข้อมูลคอมพิวเตอร์ ส่งมอบข้อมูลคอมพิวเตอร์ หรืออุปกรณ์ดังกล่าวให้แก่พนักงานเจ้าหน้าที่</p>
        <p>(๖) ตรวจสอบหรือเข้าถึงระบบคอมพิวเตอร์ ข้อมูลคอมพิวเตอร์ ข้อมูลจราจรทางคอมพิวเตอร์ หรืออุปกรณ์ที่ใช้เก็บข้อมูลคอมพิวเตอร์ของบุคคลใด อันเป็นหลักฐานหรืออาจใช้เป็นหลักฐานเกี่ยวกับ การกระทําความผิด หรือเพื่อสืบสวนหาตัวผู้กระทําความผิดและสั่งให้บุคคลนั้นส่งข้อมูลคอมพิวเตอร์ ข้อมูลจราจรทางคอมพิวเตอร์ ที่เกี่ยวข้องเท่าที่จําเป็นให้ด้วยก็ได้</p>
        <p>(๗) ถอดรหัสลับของข้อมูลคอมพิวเตอร์ของบุคคลใด หรือสั่งให้บุคคลที่เกี่ยวข้องกับการเข้ารหัสลับ ของข้อมูลคอมพิวเตอร์ ทําการถอดรหัสลับ หรือให้ความร่วมมือกับพนักงานเจ้าหน้าที่ในการถอดรหัสลับ ดังกล่าว</p>
        <p>(๘) ยึดหรืออายัดระบบคอมพิวเตอร์เท่าที่จําเป็นเฉพาะเพื่อประโยชน์ในการทราบรายละเอียดแห่งความผิดและผู้กระทําความผิด</p>
        <p>เพื่อประโยชน์ในการสืบสวนและสอบสวนของพนักงานสอบสวนตามประมวลกฎหมายวิธีพิจารณา ความอาญา ในบรรดาความผิดอาญาต่อกฎหมายอื่นซึ่งได้ใช้ระบบคอมพิวเตอร์ ข้อมูลคอมพิวเตอร์ หรืออุปกรณ์ที่ใช้เก็บข้อมูลคอมพิวเตอร์เป็นองค์ประกอบหรือเป็นส่วนหนึ่งในการกระทําความผิด หรือมีข้อมูลคอมพิวเตอร์ที่เกี่ยวข้องกับการกระทําความผิดอาญาตามกฎหมายอื่น พนักงานสอบสวน อาจร้องขอให้พนักงานเจ้าหน้าที่ตามวรรคหนึ่งดําเนินการตามวรรคหนึ่งก็ได้ หรือหากปรากฏข้อเท็จจริง ดังกล่าวต่อพนักงานเจ้าหน้าที่เนื่องจากการปฏิบัติหน้าที่ตามพระราชบัญญัตินี้ ให้พนักงานเจ้าหน้าที่ รีบรวบรวมข้อเท็จจริงและหลักฐานแล้วแจ้งไปยังเจ้าหน้าที่ที่เกี่ยวข้องเพื่อดําเนินการต่อไป ให้ผู้ได้รับการร้องขอจากพนักงานเจ้าหน้าที่ตามวรรคหนึ่ง (๑) (๒) และ (๓) ดําเนินการ ตามคําร้องขอโดยไม่ชักช้าแต่ต้องไม่เกินเจ็ดวันนับ แต่วันที่ได้รับคําร้องขอหรือภายในระยะเวลาที่พนักงานเจ้าหน้าที่กําหนดซึ่งต้องไม่น้อยกว่าเจ็ดวันและไม่เกินสิบห้าวัน เว้นแต่ในกรณีที่มีเหตุสมควร ต้องได้รับอนุญาต จากพนักงานเจ้าหน้าที่ ทั้งนี้ รัฐมนตรีอาจประกาศในราชกิจจานุเบกษากําหนดระยะเวลาที่ต้องดําเนินการ ที่เหมาะสมกับประเภทของผู้ให้บริการก็ได้</p>

    </div>
    <?= views('template/front/footer') ?>
    <?= views('template/front/cdn_footer') ?>
</body>